app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13') ORDER BY release_date ASC
---
  def index
    @movies = Movie.all
    @all_ratings = Movie.ratings
    @sort = params[:sort]
    @selectedRatings = params[:ratings]

    if (@sort!=nil && @selectedRatings!={})
	flash.keep
	@movies =  Movie.where(:rating => @selectedRatings.keys).order(@sort + ' ASC')